backend/app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."id" ASC
---
      def index
        products = Product.by_type(params[:type]).order(:id)